InformationRegisters/КоэффициентыСтавкиРефинансированияНБДляРасчетаПени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>КоэффициентыСтавкиРефинансированияНБДляРасчетаПени</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНалога</Name>
					<Comment>Вид налога/сбора/отчисления</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НалогиСборыОтчисления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КоэффициентыСтавкиРефинансированияНБДляРасчетаПени/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьКоэффициентыДляОСМС() Экспорт
	
	НаборЗаписей = РегистрыСведений.КоэффициентыСтавкиРефинансированияНБДляРасчетаПени.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Использование = Истина;
	НаборЗаписей.Отбор.Организация.ВидСравнения	 = ВидСравнения.Равно;
	НаборЗаписей.Отбор.Организация.Значение	 	 = Справочники.Организации.ПустаяСсылка();
	
	// Взносы ОСМС
	НаборЗаписей.Отбор.ВидНалога.Использование = Истина;
	НаборЗаписей.Отбор.ВидНалога.ВидСравнения  = ВидСравнения.Равно;
	НаборЗаписей.Отбор.ВидНалога.Значение	   = Справочники.НалогиСборыОтчисления.ВзносыОбязательноеСоциальноеМедицинскоеСтрахование;

	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период = '20170701';
	НоваяЗапись.ВидНалога = Справочники.НалогиСборыОтчисления.ВзносыОбязательноеСоциальноеМедицинскоеСтрахование;
	НоваяЗапись.Коэффициент = 2.5;
	
	Попытка
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		НаборЗаписей.Записать();
		НаборЗаписей.Очистить();
	Исключение
		ТекстСообщения = НСтр("ru='Операция не выполнена'");
		ЗаписьЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	// Отчисления ОСМС
	НаборЗаписей.Отбор.ВидНалога.Использование = Истина;
	НаборЗаписей.Отбор.ВидНалога.ВидСравнения  = ВидСравнения.Равно;
	НаборЗаписей.Отбор.ВидНалога.Значение	   = Справочники.НалогиСборыОтчисления.ОтчисленияОбязательноеСоциальноеМедицинскоеСтрахование;
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период = '20170701';
	НоваяЗапись.ВидНалога = Справочники.НалогиСборыОтчисления.ОтчисленияОбязательноеСоциальноеМедицинскоеСтрахование;
	НоваяЗапись.Коэффициент = 2.5;
	
	Попытка
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		НаборЗаписей.Записать();
		НаборЗаписей.Очистить();
	Исключение
		ТекстСообщения = НСтр("ru='Операция не выполнена'");
		ЗаписьЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьКоэффициентыДляОПВР() Экспорт
	
	НаборЗаписей = РегистрыСведений.КоэффициентыСтавкиРефинансированияНБДляРасчетаПени.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Использование = Истина;
	НаборЗаписей.Отбор.Организация.ВидСравнения	 = ВидСравнения.Равно;
	НаборЗаписей.Отбор.Организация.Значение	 	 = Справочники.Организации.ПустаяСсылка();
	
	// ОПВР
	НаборЗаписей.Отбор.ВидНалога.Использование = Истина;
	НаборЗаписей.Отбор.ВидНалога.ВидСравнения  = ВидСравнения.Равно;
	НаборЗаписей.Отбор.ВидНалога.Значение	   = Справочники.НалогиСборыОтчисления.ОбязательныеПенсионныеВзносыРаботодателя;
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период = '20240101';
	НоваяЗапись.ВидНалога = Справочники.НалогиСборыОтчисления.ОбязательныеПенсионныеВзносыРаботодателя;
	НоваяЗапись.Коэффициент = 1.25;
	
	Попытка
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		НаборЗаписей.Записать();
		НаборЗаписей.Очистить();
	Исключение
		ТекстСообщения = НСтр("ru='Операция не выполнена'");
		ЗаписьЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий
//Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
//Код процедур и функций
#КонецОбласти

#КонецЕсли
